# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

"""
fruits = ["яблоко", "банан", "киви", "арбуз"]
i = 1
for el in fruits:
    print ('{}.{:>6}'.format(i, el))
    i += 1
"""
# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке и выведите результат.
"""
list1 = [1, 2, 3, 4, 5]
list2 = [1, 2, 3, 4]
for el in list2:
    if el in list1:
        list1.remove(el)
print(list1)
"""
# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.
# и выведите результат

list1 = [4, 5, 12, 17, 20]
list2 = []
for el in list1:
    if el % 2 == 0:
       list2.append(el / 4)
    else:
        list2.append(el * 2)
print(list2)
