# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [0, 1, 2, 3] --> [0, 1, 4, 9]
"""
my_list = [0, 1, 2, 3]
new_list = [el **2 for el in my_list]
print(new_list)
"""
# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

"""
list1 = ["яблоко", "бананчик", "арбузик", "дынька", "мандаринчик", "королек"]
list2 = ["яблоко", "бананчик", "арбузик", "апельсин"]
list3 = [item for item in list1 if item in list2]
print(list3)
"""
# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 2
# + Элемент неотрицательный
# + Элемент не кратен 3

list1 = [3, 2, 5, 10, 58, 20, 44, 31, -2, -16, -33, -4]
list2 = [el for el in list1 if el % 2 == 0 and el >= 0 and el % 3 != 0]
print(list2)