
#__author__ = 'Alana Daurova'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в этом числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с ризом для.

"""nomber = int(input("Введите произвольное целое положительное число: "))
max_val = 0
while nomber>0:
    y = nomber % 10
    if y > max_val:
        max_val = y
    nomber //=10
print(max_val)"""

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

"""a = int(input('ведите проивольное числo: '))
b = int(input('ведите проивольное числo: '))
a = a + b
b = a - b
a = a - b
print("Значения после замены переменных: " "a =", a, "b =", b)"""


# Задача-3: написать программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt () модуля math:
# import math
# math.sqrt (4) - вычисляет корень числа 4







